{
 "Name": "BEEF TACOS WITH WASABI MAYO",
 "Tags": "Steak, Rind, Tacos, Gordon Ramsay, Fastfood, Einfach",
 "Serves": 2,
 "Ingredients": "2 beef sirloin steaks\nOlive oil, for frying\n6–8 small (14cm) corn tortillas, to serve\n\nFOR THE MARINADE\n2 tbsp light miso paste\n2 tbsp mirin\n1 tbsp caster sugar\n2 tbsp olive oil\nSea salt and freshly ground black pepper\n\nFOR THE QUICK PICKLED CABBAGE\n½ head of Chinese cabbage, finely shredded\n1–1½ tbsp rice vinegar or lemon juice\n½ tsp toasted sesame oil\n1 tsp dried chilli flakes\n\nFOR THE WASABI MAYO\n½ tsp wasabi, to taste\n2 heaped tbsp mayonnaise",
 "Method": "1. First prepare the marinade. Mix the miso paste, mirin, sugar and olive oil, stirring well\nto dissolve the sugar. Season and add a tablespoon of water if the mixture needs loosening a\nlittle.\n2. Leave the fat on the steaks to stop them drying out as you cook them. Season them well\nand fry in a hot oiled frying pan for 2–3 minutes on either side for rare/medium rare, or\nuntil cooked to your liking. (Shake the pan gently as you put the steaks in the pan to stop\nthem sticking, otherwise they might burn.) Render the fat by tipping the steaks onto their\nsides and cooking until the fat is golden and crisp. Keep basting the steaks as you cook.\n3. When the steaks are cooked, remove from the pan and cut off the remaining layer of fat.\nPlace the steaks in the marinade, coating all sides. Leave to rest, spooning the marinade\nover now and again.\n4. Meanwhile, prepare the quick pickled cabbage. Put the cabbage in a bowl and season\nwith salt and pepper. Add the rice vinegar, sesame oil and chilli flakes. Toss the mixture to\ncoat, then leave to soften slightly for a couple of minutes.\n5. Meanwhile, mix together the wasabi and mayonnaise, taste and add a little more wasabi\nif you like a stronger flavour.\n6. Heat the tortillas for 30–60 seconds over a naked gas flame until charred and lightly\ntoasted (use a pan if you don’t have gas). Roll them around a rolling pin while they’re still\nhot, and hold until cooled to set in half-moon shapes. In this form they are called ‘tacos’.\n7. Drain the beef of any excess marinade, then slice and place in the tacos. Top with the\ncabbage (drained of excess liquid) and a little wasabi mayo."
}
