{
 "Name": "SLOW-ROASTED PORK BELLY WITH FENNEL",
 "Tags": "Schwein, Schweinebauch, Braten, Gordon Ramsay",
 "Serves": 4,
 "Ingredients": "1: kg pork belly\n :Sea salt and black pepper\n1: fennel bulb, trimmed and roughly sliced\n4: fresh bay leaves\n3: garlic cloves, peeled and bashed\n1: tsp cardamom pods, bashed\n4: star anise\n1: tbsp fennel seeds\n :Olive oil\n325: ml white wine\n500–750: ml chicken stock (depending on the size of your pan)\n1 :tbsp wholegrain mustard",
 "Method": "1. Preheat the oven to 180°C/Gas 4.\n2. Score the pork belly skin diagonally in a diamond pattern at 1½ cm intervals. Season\ngenerously with salt and pepper, rubbing it well into the skin.\n3. Put the fennel, bay leaves, garlic, cardamom, star anise and half the fennel seeds into a\nhot roasting tray on the hob with a little oil and heat for about 2 minutes until aromatic.\nPush to the side of the tray, then add the pork, skin side down, and cook for at least 5\nminutes until turning golden brown. Turn the pork over, season the skin again with salt\nand sprinkle with the remaining fennel seeds. Pour in the wine to deglaze the pan, scraping\nup the bits from the bottom (be careful not to get the skin of the pork wet). Bring to the\nboil, then pour in enough stock to come up to the layer of fat just below the skin and\nallow to boil again.\n4. Transfer the tray to the preheated oven and cook for 2½ hours.\n5. Transfer the meat to a warm plate and set aside to rest. Meanwhile, spoon off any excess\nfat in the roasting tray or drag a slice of bread along the surface of the cooking juices to\nabsorb it. Heat the tray on the hob, adding the mustard. Mix in with a whisk, then taste\nand adjust the flavours as necessary. Remove the star anise and cardamom pods and pour\nthe sauce into a jug. Serve the rested pork with the sauce alongside.\nHOW TO SEASON PORK SKIN\nIf you slightly bend the pork as you are rubbing in the salt and fennel seeds, it will\nopen up the diamond incisions in the rind, making it easier for the flavours to\npenetrate."
}
